projects.org
#+hugo_base_dir: ./
#+hugo_section: ./projects

#+hugo_weight: auto
#+hugo_auto_set_lastmod: t

#+author: Roger Gonzalez

* Certn - International framework
:PROPERTIES:
:EXPORT_FILE_NAME: certn-intl-framework
:EXPORT_DATE: 2020-09-01
:END:
** About the project
[[https://certn.co][Certn]] is an app that wants to ease the process of background checks for criminal
records, education, employment verification, credit reports, etc. On
International Framework, we worked on an app that acts like a bridge between our
main app and criminal background check providers (like the [[https://rcmp-grc.gc.ca][RCMP]]).
** Tech Stack
- Python
- Django
- Django REST Framework
- Celery
- PostgreSQL
- Docker/docker-compose
- Swagger
- Sentry.io
- Github Actions
- Jenkins
** What did I work on?
- Database design.
- Models and endpoints design.
- Github Actions configurations.
- Jenkins configuration.
- Standardized the code with [[https://flake8.pycqa.org/en/latest/][Flake]], [[https://www.pylint.org/][pylint]] and [[https://black.readthedocs.io/en/stable/][Black]].

