content/projects/certn-intl-framework.md
+++
title = "Certn - International framework"
author = ["Roger Gonzalez"]
date = 2020-09-01
lastmod = 2023-01-14T14:07:18-03:00
draft = false
weight = 1003
+++

## About the project {#about-the-project}

[Certn](https://certn.co) is an app that wants to ease the process of background checks for criminal
records, education, employment verification, credit reports, etc.
On International Framework, we worked on an app that acts like a bridge between our
main app and criminal background check providers (like the [RCMP](https://rcmp-grc.gc.ca)).


## Tech Stack {#tech-stack}

-   Python
-   Django
-   Django REST Framework
-   Celery
-   PostgreSQL
-   Docker/docker-compose
-   Swagger
-   Sentry.io
-   Github Actions
-   Jenkins


## What did I work on? {#what-did-i-work-on}

-   Database design.
-   Models and endpoints design.
-   Github Actions configurations.
-   Jenkins configuration.
-   Standardized the code with [Flake](https://flake8.pycqa.org/en/latest/), [pylint](https://www.pylint.org/) and [Black](https://black.readthedocs.io/en/stable/).
